app/controllers/docs_controller.rb

  def index
    @docs = Doc.all
---
SELECT "docs".* FROM "docs"

  def show
    @doc = Doc.find(params[:id])
---
SELECT "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @doc = Doc.new(doc_params)
    if @doc.save
---
INSERT INTO "docs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "HOT"], ["body", "ffd vdfjd jyrrkukuy"], ["created_at", "2024-04-21 16:23:01.833059"], ["updated_at", "2024-04-21 16:23:01.833059"]]

  def edit
    @doc = Doc.find(params[:id])
---
SELECT "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @doc = Doc.find(params[:id])
    if @doc.update(doc_params)
---
SELECT "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "docs" SET "body" = $1, "updated_at" = $2 WHERE "docs"."id" = $3  [["body", "jlkkkkkkkkkkkkkkk"], ["updated_at", "2024-04-21 16:23:16.787060"], ["id", 3]]

  def destroy
    @doc = Doc.find(params[:id])
    @doc.destroy
---
SELECT "docs".* FROM "docs" WHERE "docs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "docs" WHERE "docs"."id" = $1  [["id", 3]]